In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:Murasa@123@localhost:3306/m_water_services

'Connected: root@m_water_services'

In [6]:
%%sql
#select the employees table

SELECT * 
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', None, '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', None, '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [7]:
%%sql
#replace the space btn first and last names

SELECT 
    employee_name,
    REPLACE(employee_name, ' ', '.')
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[('Amara Jengo', 'Amara.Jengo'),
 ('Bello Azibo', 'Bello.Azibo'),
 ('Bakari Iniko', 'Bakari.Iniko'),
 ('Malachi Mavuso', 'Malachi.Mavuso'),
 ('Cheche Buhle', 'Cheche.Buhle')]

In [12]:
%%sql
#constructing a fine email from the employees' names

SELECT 
    employee_name,
    CONCAT(LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov') AS email
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[('Amara Jengo', 'amara.jengo@ndogowater.gov'),
 ('Bello Azibo', 'bello.azibo@ndogowater.gov'),
 ('Bakari Iniko', 'bakari.iniko@ndogowater.gov'),
 ('Malachi Mavuso', 'malachi.mavuso@ndogowater.gov'),
 ('Cheche Buhle', 'cheche.buhle@ndogowater.gov')]

In [16]:
%%sql
# updating the current email column with new emails in employees table

UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov')

 * mysql+pymysql://root:***@localhost:3306/m_water_services
56 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [17]:
%%sql

SELECT * 
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [25]:
%%sql
# remove the space in the phone_number column

SELECT 
    LENGTH(TRIM(phone_number))
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[(12,), (12,), (12,), (12,), (12,)]

In [27]:
%%sql
# updating the 'phone_number' column by the trimmed values

UPDATE employee
SET 
    phone_number = TRIM(phone_number);

 * mysql+pymysql://root:***@localhost:3306/m_water_services
56 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [28]:
%%sql

SELECT * 
FROM employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [33]:
%%sql

SELECT 
    DISTINCT town_name,
    COUNT(employee_name) AS number_of_employees_per_town
FROM employee
GROUP BY town_name;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

In [34]:
%%sql

SELECT * 
FROM visits
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14)]

In [35]:
%%sql

SELECT 
    assigned_employee_id,
    COUNT(visit_count) AS number_of_visits
FROM visits
GROUP BY
    assigned_employee_id
ORDER BY 
    assigned_employee_id ASC
LIMIT 3
;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
3 rows affected.

[(0, 1099), (1, 3708), (2, 2033)]

In [36]:
%%sql
#the top 3 field surveyors names,emails and phone number

SELECT
    employee_name,
    phone_number,
    email
FROM employee
WHERE 
    assigned_employee_id IN (0,1,2)
;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
3 rows affected.

[('Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov'),
 ('Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov'),
 ('Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov')]

In [40]:
%%sql

SELECT * 
FROM location
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
10 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00003', '139 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00004', '17 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00005', '125 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00006', '98 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00007', '21 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00008', '11 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00009', '6 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

In [45]:
%%sql
# number of records per town in location table

SELECT  
    DISTINCT(town_name),
    COUNT(town_name) AS records_per_town
FROM location
GROUP BY town_name
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
10 rows affected.

[('Harare', 1650),
 ('Kintampo', 780),
 ('Lusaka', 1070),
 ('Rural', 23740),
 ('Abidjan', 400),
 ('Amina', 1090),
 ('Asmara', 930),
 ('Bello', 400),
 ('Dahabu', 930),
 ('Pwani', 520)]

In [47]:
%%sql
# number of records per province in location table

SELECT  
    DISTINCT(province_name),
    COUNT(province_name) AS records_per_town
FROM location
GROUP BY province_name
;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
5 rows affected.

[('Akatsi', 8940),
 ('Amanzi', 6950),
 ('Hawassa', 6030),
 ('Kilimani', 9510),
 ('Sokoto', 8220)]

In [54]:
%%sql
# number of records per town in their respective provinces

SELECT
    province_name,
    town_name,
    COUNT(*) AS records_per_town
FROM
    location
GROUP BY
    province_name, town_name
ORDER BY
    province_name, records_per_town DESC, town_name;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
31 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100),
 ('Amanzi', 'Asmara', 930),
 ('Amanzi', 'Dahabu', 930),
 ('Amanzi', 'Amina', 670),
 ('Amanzi', 'Pwani', 520),
 ('Amanzi', 'Abidjan', 400),
 ('Amanzi', 'Bello', 400),
 ('Hawassa', 'Rural', 3900),
 ('Hawassa', 'Serowe', 480),
 ('Hawassa', 'Amina', 420),
 ('Hawassa', 'Deka', 350),
 ('Hawassa', 'Djenne', 310),
 ('Hawassa', 'Zanzibar', 300),
 ('Hawassa', 'Yaounde', 270),
 ('Kilimani', 'Rural', 5440),
 ('Kilimani', 'Mrembo', 990),
 ('Kilimani', 'Harare', 850),
 ('Kilimani', 'Isiqalo', 770),
 ('Kilimani', 'Zuri', 750),
 ('Kilimani', 'Amara', 710),
 ('Sokoto', 'Rural', 5010),
 ('Sokoto', 'Ilanga', 780),
 ('Sokoto', 'Majengo', 620),
 ('Sokoto', 'Kofi', 510),
 ('Sokoto', 'Bahari', 470),
 ('Sokoto', 'Marang', 460),
 ('Sokoto', 'Cheche', 370)]

In [58]:
%%sql
# number of records for each location type

SELECT
    DISTINCT(location_type),
    COUNT(*) as records_per_location_type
    
FROM location
GROUP BY location_type;

 * mysql+pymysql://root:***@localhost:3306/m_water_services
2 rows affected.

[('Urban', 15910), ('Rural', 23740)]